#Задачи на циклы и оператор условия------
#----------------------------------------

'''
Задача 1

Вывести на экран циклом пять строк из нулей длиной 4, причем каждая строка должна быть пронумерована.

Пример:
0 0000
1 0000
2 0000
3 0000
....
'''

'''
Задача 2

Пользователь в цикле вводит 10 производных цифр. Вывелите количество введеных пользователем цифр 5.
'''

'''
Задача 3

Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
'''
'''
Задача 4

Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран(можно поискать в интернете алгоритм факториала в python).
'''

'''
(!!!Подсказка на следующие 5 задач - превратите число в строку, а потом работайте с строкой)
Задача 5

Вывести цифры числа на каждой строчке.
'''
'''
Задача 6

Найти сумму цифр числа.
'''


'''
Задача 7

Найти произведение цифр числа.
'''

'''
Задача 8

Дать ответ на вопрос: есть ли среди цифр числа 5?
'''

'''
Задача 9

Найти максимальную цифру в числе
'''


'''
Задача 10

Найти количество цифр 5 в числе
'''
